{
  "backend/main.mo": "Main Motoko actor defining data types (User, StrayDogImage, Product, Event, ChatMessage) and public functions for user registration, stray dog image uploads, product/event management, and community chat with blob storage integration.",
  "feature_evidence.json": "Feature evidence report documenting two completed features: creation of the About Us page at /about route and addition of About Us navigation link in the header.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend source files describing their purpose and functionality across pages, components, hooks, and configuration files.",
  "frontend/index.css": "Global CSS with Tailwind directives defining OKLCH color system variables for light and dark modes with emerald/green/teal theme colors.",
  "frontend/index.html": "HTML entry point with root div and module script loading main.tsx for the SmartVaxRabies application.",
  "frontend/src/App.tsx": "TanStack Router configuration defining all application routes (home, register, stray dogs, shop, events, community, about) wrapped in Layout component.",
  "frontend/src/components/ChatMessage.tsx": "Chat message component displaying formatted sender principal with color-coded avatar, timestamp, and message text in styled bubble layout.",
  "frontend/src/components/EventCard.tsx": "Event card component showing event details with calendar/location icons, formatted date/time, description, registration link, and visual distinction for past events.",
  "frontend/src/components/Layout.tsx": "Main layout with sticky header navigation including About Us link, SmartVaxRabies logo, responsive mobile menu, and footer with Kerala branding and caffeine.ai attribution.",
  "frontend/src/components/ProductCard.tsx": "Product card component displaying product image via ExternalBlob, name, description, INR-formatted price, and add-to-cart button with hover effects.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that manages the backend actor instance using React Query, creating authenticated or anonymous actors based on Internet Identity state and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and hooks for managing user login/logout state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file indicating that queries are implemented directly in page components using useQuery and useMutation hooks with the actor from useActor.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining a green-themed color palette for light and dark modes, including primary, secondary, accent, and chart colors with emerald/green hues, plus custom scrollbar styling.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the root App component into the DOM.",
  "frontend/src/pages/About.tsx": "Static About page component displaying SmartVaxRabies mission, features (compassionate care, community driven, education), and creators section with hero banner and grid layout.",
  "frontend/src/pages/Community.tsx": "Community chat page that fetches and displays messages using React Query, allows authenticated users to send messages, and auto-refreshes every 5 seconds with auto-scroll to latest messages.",
  "frontend/src/pages/Events.tsx": "Events listing page that fetches and displays charity events sorted by date using React Query, showing event cards in a responsive grid or empty state when no events exist.",
  "frontend/src/pages/Home.tsx": "Home page component displaying a hero section with call-to-action buttons and a grid of six feature cards linking to vaccination registration, stray dog support, shop, events, community chat, and stray dog gallery.",
  "frontend/src/pages/Register.tsx": "Vaccination registration form page that collects user details (name, email, phone, location) and allows selection from a list of Kerala vaccination centres, with success notification upon submission.",
  "frontend/src/pages/Shop.tsx": "Dog supplies shop page that fetches and displays products in a grid layout with a banner image, showing loading state or empty state when no products are available.",
  "frontend/src/pages/StrayDogGallery.tsx": "Gallery page displaying submitted stray dog reports with images, location, description, uploader name, and timestamp in a card grid layout with link to submit new reports.",
  "frontend/src/pages/StrayDogSubmission.tsx": "Form page for uploading stray dog images with location, description, and uploader name fields, featuring image preview, upload progress tracking, and success notification.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color schemes using OKLCH color space, extended border radius values, custom fonts, shadows, and keyframe animations for the application theme.",
  "project_state.json": "Project state metadata tracking SmartVaxRabies application features, including existing About Us page feature with creators Shreya Salu and Bella Ann Kurian from Excelsior English School, and pending feature request AR-1."
}